In [64]:
import pandas
data = pd.read_csv('cats.csv')
data.tail(5)
data.drop(['Unnamed: 0'], inplace=True, axis=1)
list(data.columns)

['Breed', 'Age (Years)', 'Weight (kg)', 'Color', 'Gender', 'ID']

In [76]:
data.iloc[[98]]

         Breed  Age (Years)  Weight (kg) Color  Gender   ID
98  Maine Coon            9            5  Blue  Female  590

In [78]:
data.loc[98]

Breed          Maine Coon
Age (Years)             9
Weight (kg)             5
Color                Blue
Gender             Female
ID                    590
Name: 98, dtype: object

In [82]:
data.loc[0]['Weight (kg)']

7

In [84]:
data.loc[len(data)] = ["Zuko", 3, 5, "Orange", "Male", len(data)]
data.tail

<bound method NDFrame.tail of               Breed  Age (Years)  Weight (kg)          Color  Gender    ID
0      Egyptian Mau           12            7          White    Male   181
1     Scottish Fold           17            8  Tortoiseshell    Male   907
2            Sphynx            9            9         Orange    Male   732
3          Oriental            6            7           Gray  Female   464
4          Savannah           14            7  Tortoiseshell  Female   451
...             ...          ...          ...            ...     ...   ...
997         Persian           19            9          Cream    Male   659
998         Persian           17            3        Bicolor  Female   124
999            Manx           18            8          Black    Male   226
1000   Orange Tabby            3            5         Orange    Male  1000
1001           Zuko            3            5         Orange    Male  1001

[1002 rows x 6 columns]>

In [85]:
data['Weight in Lbs'] = data['Weight (kg)'] * 2.205

In [86]:
data.head

<bound method NDFrame.head of               Breed  Age (Years)  Weight (kg)          Color  Gender    ID  \
0      Egyptian Mau           12            7          White    Male   181
1     Scottish Fold           17            8  Tortoiseshell    Male   907
2            Sphynx            9            9         Orange    Male   732
3          Oriental            6            7           Gray  Female   464
4          Savannah           14            7  Tortoiseshell  Female   451
...             ...          ...          ...            ...     ...   ...
997         Persian           19            9          Cream    Male   659
998         Persian           17            3        Bicolor  Female   124
999            Manx           18            8          Black    Male   226
1000   Orange Tabby            3            5         Orange    Male  1000
1001           Zuko            3            5         Orange    Male  1001

      Weight in Lbs
0            15.435
1            17.640
2            19.845
3            15.435
4            15.435
...             ...
997          19.845
998           6.615
999          17.640
1000         11.025
1001         11.025

[1002 rows x 7 columns]>